flatiron-match-backend/app/controllers/cards_controller.rb

    def index
        cards = Card.all
---
SELECT "cards".* FROM "cards"