flatiron-match-backend/app/controllers/comments_controller.rb

    def index
        comments = Comment.all
---
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.create!(comment_params)
---
INSERT INTO "comments" ("user_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 47], ["text", "the enemy"], ["created_at", "2020-07-30 18:10:20.143217"], ["updated_at", "2020-07-30 18:10:20.143217"]]

    def destroy
        comment = Comment.find(params[:id])

        comment.destroy!
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 8]]