flatiron-match-backend/app/controllers/decks_controller.rb

SELECT "decks".* FROM "decks"
---
    def index
        decks = Deck.all