flatiron-match-backend/app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
    def index
        games = Game.all