flatiron-match-backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 114], ["LIMIT", 1]]
---
    def show
        user = User.find(params[:id])

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2020-07-29 17:46:36.886269"], ["updated_at", "2020-07-29 17:46:36.886269"]]
---
    def create
        user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", ""], ["updated_at", "2020-07-29 19:44:00.243556"], ["id", 1]]
---
    def update
        user = User.find(params[:id])

        user.update!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 29]]
---
    def destroy
        user = User.find(params[:id])

        user.destroy!